// Auto-generated — do not edit manually
export default `<h1>通关</h1>
<p>关内有织女，关外有牛郎，此关若通也，相邀入洞户。</p>
<p>【原注】天气欲不降，地气欲上升，欲相合相和相生也。木土而要火，火金而要土，土水而要金，金木而要水，皆是牛郎织女之有情也。中间上下远隔，为物所间；前后远绝，或被刑冲，或被劫占，或隔一物，皆谓之关也。必得引用无合之神及刑冲所间之物，前后上下，授引得来，能胜劫占之神，能补所缺之物，明见暗会，岁运相逢，乃为通关也。必得引用无合之神，及刑冲所间之物，前后上下，援引得来，能胜劫占之神，能补所缺之物，明见暗会，岁运相逢，乃为通关也。关通而其愿遂矣，不犹牛郎织女之入洞房也哉？</p>
<p>【任氏曰】通关者，引通克制之神也。所谓阴阳二用，妙在气交，天降而下，地升而上。天干之气动而专，地支之气静而杂，是故地运有推移，而天气从之；天气有转徒，而地运应之；天气动于上，而人元应之；人元动于下，而天气从之，所以阴胜逢阳则止，阳胜逢阴则往，是谓天地交泰，干支有情，左右不背，阴阳生育而相通也，若杀重喜印，杀露印亦露，煞藏印亦藏，此显然通达，不必节外生枝。倘原局无印，必须岁运逢印，向而通之，或暗会明合而通之，局内有印，被财星损坏，或官星化之，或比劫解之，或被合住，则冲开之，或被冲坏，则合化之，或隔一物，则克去之，前后上下，不能授引，得岁运相逢尤佳。如年印时杀，干杀支印，前后远立，上下悬隔，或为间神忌物所间，此原局无可通之理，必须岁运暗冲暗会，克制间神忌物，该冲则冲，该合则合，引通相克之势，此关一通，所谓琴遇子期，马逢伯乐，求名者青钱万选，问利者意则屡中，如牛郎织女之入洞房，无不其所愿。杀印之论如此，食伤财官之论亦如此。</p>
`;
